## concat data

In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})
df3 = pd.DataFrame({'A': [9, 10], 'B': [11, 12]})

In [7]:
df1

   A  B
0  1  3
1  2  4

In [4]:
df2

   A  B
0  5  7
1  6  8

In [8]:
df3

    A   B
0   9  11
1  10  12

In [9]:
pd.concat([df1,df2,df3])

    A   B
0   1   3
1   2   4
0   5   7
1   6   8
0   9  11
1  10  12

In [ ]:
df1 = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["Alice", "Bob", "Charlie"]
})


df2 = pd.DataFrame({
    "id": [2, 3, 4],
    "age": [25, 30, 35]
})

df3 = pd.DataFrame({
    "id": [1, 3, 4],
    "city": ["Kathmandu", "Pokhara", "Butwal"]
})